# YzJustification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..YzJustification Property
ParameterTypeId Class See Also
---
"yz Justification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId YzJustification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property YzJustification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ YzJustification {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace